Merge pull request #142 from armadakv/feat/arctl
docs: arch diagrams in mermaid
